Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 32, 34, 1)]       0
_________________________________________________________________
conv2d (Conv2D)              (None, 16, 17, 64)        1664
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 16, 17, 64)        0
_________________________________________________________________
dropout (Dropout)            (None, 16, 17, 64)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 9, 128)         204928
_________________________________________________________________
batch_normalization (BatchNo (None, 8, 9, 128)         512
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 8, 9, 128)         0
_________________________________________________________________
dropout_1 (Dropout)          (None, 8, 9, 128)         0
_________________________________________________________________
flatten (Flatten)            (None, 9216)              0
_________________________________________________________________
dense (Dense)                (None, 100)               921700
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 101
=================================================================
Total params: 1,128,905
Trainable params: 1,128,649
Non-trainable params: 256
_________________________________________________________________
None
_________________________________________________________
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_2 (InputLayer)         [(None, 34)]              0
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              143360
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 4096)              0
_________________________________________________________________
dense_3 (Dense)              (None, 8704)              35660288
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 8704)              0
_________________________________________________________________
dense_4 (Dense)              (None, 1088)              9471040
_________________________________________________________________
tf_op_layer_Tanh (TensorFlow [(None, 1088)]            0
_________________________________________________________________
reshape (Reshape)            (None, 32, 34, 1)         0
=================================================================
Total params: 45,274,688
Trainable params: 45,274,688
Non-trainable params: 0